[
    {"question": "What does one penguin say to another penguin?", "response": "I love you like no one else" },
    {"question": "The one who makes it doesn't want it; the one who buys it doesn't use it; the one who uses it doesn't know it. What is it?", "response": "A coffin" },
    {"question": "It can run but never walk, it has a mouth but never talks. What is it?", "response": "A river" },
    {"question": "It has keys but cannot open locks. What is it?", "response": "A piano" },
    {"question": "It goes up and down but never moves. What is it?", "response": "A staircase" },
    {"question": "I am a 7-letter word, if you say me, I take your breath away. If you add one more letter, I seem quite cold, but if you remove one, I become essential. What am I?", "response": "Silence" },
    {"question": "It enters the house through the window but never leaves through the door. What is it?", "response": "Sunlight" },
    {"question": "I am always in front of you, but you can never see me. What am I?", "response": "The future" },
    {"question": "You can never keep me until you give me. What am I?", "response": "Your word" },
    {"question": "I am a symbol that always follows R but never T. What am I?", "response": "The letter E" },
    {"question": "The more you take away from me, the bigger I get. What am I?", "response": "A hole" },
    {"question": "I have cities but no buildings. I have forests but no trees. I have rivers but no water. What am I?", "response": "A map" },
    {"question": "It has keys but cannot open any door. Sometimes it has numbers but never does calculations. What is it?", "response": "A keyboard" },
    {"question": "I am a place where everyone runs but no one moves. I am always full but never crowded. What am I?", "response": "A dream" },
    {"question": "I am the beginning of wisdom, the end of life, and the middle of darkness. What am I?", "response": "The letter E" },
    {"question": "I am a number that is always in the middle of 5 and 9. What am I?", "response": "The number 7" },
    {"question": "I am a 12-letter word, but if you say me, you will have one of the 12 parts. If you write me, you will have all 12. What am I?", "response": "The alphabet" },
    {"question": "I have eyes but never cry. I have a heart but never love. What am I?", "response": "A scarecrow" },
    {"question": "I am a hole you can fill with objects, but if you fill me with water, I disappear. What am I?", "response": "A black hole" },
    {"question": "I have a neck but no head, and I accompany you in bed every night. What am I?", "response": "A pillow" },
    {"question": "I am a place where people go when they are broken, but I never need to be repaired. What am I?", "response": "A mirror" },
    {"question": "I have leaves but I am not a tree. I have a face but I am not a person. What am I?", "response": "A book" },
    {"question": "I am a path you can walk, but you are always going backward. What am I?", "response": "A ladder" },
    {"question": "You can never touch it, but it is always in front of you. What is it?", "response": "The future" },
    {"question": "I have an eye but cannot see. What am I?", "response": "A needle" },
    {"question": "I am always in the water but never get wet. What am I?", "response": "A shadow" },
    {"question": "I can fly without wings, I am always close to the ground, but I never fall. What am I?", "response": "A dream" },
    {"question": "I am round like a coin but have no value. What am I?", "response": "A button" },
    {"question": "I am a 5-letter word and feared more than death. If you remove the first letter, you will have a place where people live. What am I?", "response": "Prison" },
    {"question": "I am a place where you can never enter, but you can always see what is inside. What am I?", "response": "An eye" },
    {"question": "I have teeth but cannot chew. What am I?", "response": "A comb" },
    {"question": "I am a hole in the water that you can fill with a cup. What am I?", "response": "A keyhole" },
    {"question": "I have a head, a body, but no soul. What am I?", "response": "A doll" },
    {"question": "I have hands and a face but no body. What am I?", "response": "A clock" },
    {"question": "I am something that is more useful when broken. What am I?", "response": "An egg" },
    {"question": "I am a place where you can find treasures and books, but you will never find gold or words. What am I?", "response": "A library" },
    {"question": "If you name me, you break me. What am I?", "response": "Silence" },
    {"question": "I am a number without end, but I always start with 1. What am I?", "response": "The number Pi" },
    {"question": "What does a blind person say to another blind person?", "response": "See you later" },
    {"question": "What do a pin and a policeman have in common?", "response": "They both catch" },
    {"question": "What freezes when it gets hot?", "response": "A computer" },
    {"question": "What fruit has many eyes but cannot see?", "response": "A pineapple" },
    {"question": "In what language do turtles communicate?", "response": "In turtle language" },
    {"question": "What does a policeman from Seville call his gun?", "response": "My weapon" },
    {"question": "What is everything to one and nothing to others?", "response": "The mind" },
    {"question": "What is the vacuum cleaner's biggest irony?", "response": "Being allergic to dust" },
    {"question": "What disappears when you name it?", "response": "Silence" },
    {"question": "What do you need to write while sleeping?", "response": "To be awake" },
    {"question": "What object can have a face without having a body?", "response": "A coin" },
    {"question": "It feeds the house, a cabinet with ice. What is it?", "response": "The fridge" },
    {"question": "What do women have in the middle of their legs?", "response": "Knees" },
    {"question": "It goes in hard and dry and comes out soft and wet. What is it?", "response": "Chewing gum" },
    {"question": "I am in everything and in nothing. What am I?", "response": "The letter D" },
    {"question": "You continue on red but stop on green. What am I?", "response": "A watermelon" },
    {"question": "What is black when you buy it, red when you use it, and gray when you throw it away?", "response": "Charcoal" },
    {"question": "What is always in front of you but cannot be seen?", "response": "The future" },
    {"question": "Which month has 28 days?", "response": "All of them" },
    {"question": "How can someone go without sleeping for ten days and not feel tired?", "response": "By sleeping at night" },
    {"question": "What would you fill a barrel with to make it weigh the least?", "response": "Holes" },
    {"question": "If during a race you overtake the person in second place, what position are you in?", "response": "Second" },
    {"question": "Where does Thursday come before Wednesday?", "response": "In the dictionary" },
    {"question": "What goes up and down but always stays in the same place?", "response": "Stairs" },
    {"question": "How do they call an elevator in China?", "response": "By pressing the button" },
    {"question": "What is the first thing an elephant does when the sun rises?", "response": "Makes a shadow" },
    {"question": "Why can't a Tyrannosaurus Rex clap?", "response": "Because it is extinct" },
    {"question": "What animal is always full?", "response": "A whale" },
    {"question": "What is the first thing everyone does when they wake up?", "response": "Open their eyes" },
    {"question": "What number, if you take away half, becomes 0?", "response": "The number 8" },
    {"question": "What do you need to light a candle?", "response": "For it to be unlit" },
    {"question": "What is the country where everything ends?", "response": "Finland" },
    {"question": "The answer to this question is #######", "response": "#######" },
    {"question": "What is the end of everything?", "response": "The letter O" },
    {"question": "Where does one wall meet another wall?", "response": "In the corner" },
    {"question": "What has many words but never speaks?", "response": "A book" },
    {"question": "What belongs to you but is used more by others?", "response": "Your name" },
    {"question": "When does a person become a fruit?", "response": "When they wait" },
    {"question": "José's parents have three children: Luis, Raúl, and...? What is the name of the third child?", "response": "José" },
    {"question": "What word in the dictionary is spelled incorrectly?", "response": "Incorrectly" },
    {"question": "Wet on the inside, hairy on the outside. Starts with C. What is it?", "response": "A coconut" },
    {"question": "David and Fabian are playing chess. They have played 5 games, but both have won 3. How is this possible?", "response": "Because they are playing with other people" },
    {"question": "How many 9s are there between 1 and 100?", "response": "20" },
    {"question": "They are two fans that never stop during the day, but when you sleep, they stop and stay still. What are they?", "response": "Eyelashes" },
    {"question": "It looks like gold, it is not silver, and if you don't guess it, you're a fool. What is it?", "response": "A banana" },
    {"question": "A perfectly round circle that, if you hit it, makes you jump in fright. What is it?", "response": "A drum" },
    {"question": "A white horse entered the Black Sea. How did it come out?", "response": "Wet" },
    {"question": "If an electric train is going from North to South, which way does the smoke go?", "response": "It doesn't produce smoke; it's electric" },
    {"question": "It has 4 letters, starts with C, ends with O, and is on the back. What is it?", "response": "The elbow" },
    {"question": "A plane crashes, and everyone dies, right on the border between Spain and Portugal. To which hospital should the survivors be taken?", "response": "There are no survivors" },
    {"question": "This bench is occupied by a father and a son. The father is named Juan, and the son, I've already told you. What is his name?", "response": "Esteban" },
    {"question": "Some months have 31 days, others only 30. How many have 28 days?", "response": "All of them" },
    {"question": "What can you find once in a minute, twice in a moment, and never in a hundred years?", "response": "The letter M" },
    {"question": "Which tire doesn't turn to the right?", "response": "The spare tire" },
    {"question": "People buy me to eat, but they never eat me. What am I?", "response": "A plate" },
    {"question": "We kill and encourage; you decide if we are poison or sweet. What are we?", "response": "Words" },
    {"question": "With which hands is it better to stir the soup?", "response": "It's better to use a spoon" },
    {"question": "What gets wet while drying?", "response": "A towel" },
    {"question": "The more you take away, the bigger I get. What am I?", "response": "A moat" },
    {"question": "What word is p_ta?", "response": "Pata" },
    {"question": "I have a pair, they hang, and when I walk, they move. What are they?", "response": "Arms" },
    {"question": "What is long and hangs in front of men?", "response": "A tie" },
    {"question": "What is the most selfish toy?", "response": "The Yo-Yo" },
    {"question": "What does a person do when running quickly around the university?", "response": "Their university career" },
    {"question": "They are not flowers, but they have plants and smells. What are they?", "response": "Feet" },
    {"question": "You can't see it, but you can't live without it. What is it?", "response": "Air" }
]
